/*데이터베이스 설계 기초
집을 짓기전에 든든한 뼈대와 방의 위치를 그리는 설계도가 필요하듯
데이터를 컴퓨터에 저장하기 전에 어떤 데이터를 어떤 구조로 어떻게 연결해서
저장할지 스케치하고 구체화 하는 작업입니다
이 과정이 엉망이면 나중에 집(프로그램)이 무너지거나 물이 샙니다.(데이터 중복/손실)
데이터베이스 설계의 4단계 마법
요구사항 분석: 사용자가 뭘 저장하고 싶은지 파악
개념적 설계: 개체와 속성을 찾고 관계를 그림으로 파악
논리적 설계: 그림을 표 형태로 변환 하고 정규화 전환
물리적 설계: 실제 오라클 db에 맞게 데이터 타입과 인덱스 결정
엔티디: 사람, 장소, 사물 나중에 테이블이 된다
속성: 엔티티의 특징 나중에 컬럼이 된다
관계: 엔티티 사이의 연관성 pk와 fk로 연결
실전! 쇼핑몰 데이터베이스 설계 맛보기
요구사항: 우리 쇼핑몰은 회원이 상품을 주문할 수 있어야 해요
1단계: 엔티티의 관계 찾기
엔티티: 회원, 상품, 주문
관계: 회원이 상품을 주문한다(1:n 관계)
속성
회원: 회원 아이디, 회원명, 전화번호, 가입일
상품: 상품명, 가격
주문: 주문수량, 주문날짜
2&3단계: 논리적/물리적 설계
논리적 모델
회원(member): 회원 아이디(member_id - varchar2(20),키설정),회원명(member_name - vachar2(50)), 전화번호(phone - varchar2(15),
 가입일(join_date - date)
상품: 상품코드(prod_name - varchar2(15) 상품명(prod_name -varchar(100)), 가격(price-number)
주문: 주문번호(oreder _no - number,키), 주문수량(order_qty - number), 주문날짜(order_date -date)
    
*/